cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32GG8xx.svd
        <register>
          <name>ROUTE</name>
          <description>I/O Routing Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x777F10FF</resetMask>
          <fields>
            <field>
              <name>EBIPEN</name>
              <description>EBI Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS0PEN</name>
              <description>EBI_CS0 Pin Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS1PEN</name>
              <description>EBI_CS1 Pin Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS2PEN</name>
              <description>EBI_CS2 Pin Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS3PEN</name>
              <description>EBI_CS3 Pin Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALEPEN</name>
              <description>EBI_ALE Pin Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYPEN</name>
              <description>EBI_ARDY Pin Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLPEN</name>
              <description>EBI_BL[1:0] Pin Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NANDPEN</name>
              <description>NANDRE and NANDWE Pin Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALB</name>
              <description>Sets the lower bound for EBI_A enabling</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>Address lines from EBI_A[0] and upwards can be enabled via APEN.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8</name>
                  <description>Address lines from EBI_A[8] and upwards can be enabled via APEN.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A16</name>
                  <description>Address lines from EBI_A[16] and upwards can be enabled via APEN.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A24</name>
                  <description>Address lines from EBI_A[24] and upwards can be enabled via APEN.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APEN</name>
              <description>EBI_A Pin Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>All EBI_A pins are disabled.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5</name>
                  <description>EBI_A[4:L] pins enabled.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6</name>
                  <description>EBI_A[5:L] pins enabled.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7</name>
                  <description>EBI_A[6:L] pins enabled.</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8</name>
                  <description>EBI_A[7:L] pins enabled.</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A9</name>
                  <description>EBI_A[8:L] pins enabled.</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A10</name>
                  <description>EBI_A[9:L] pins enabled.</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A11</name>
                  <description>EBI_A[10:L] pins enabled.</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A12</name>
                  <description>EBI_A[11:L] pins enabled.</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A13</name>
                  <description>EBI_A[12:L] pins enabled.</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A14</name>
                  <description>EBI_A[13:L] pins enabled.</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A15</name>
                  <description>EBI_A[14:L] pins enabled.</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A16</name>
                  <description>EBI_A[15:L] pins enabled.</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A17</name>
                  <description>EBI_A[16:L] pins enabled.</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A18</name>
                  <description>EBI_A[17:L] pins enabled.</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A19</name>
                  <description>EBI_A[18:L] pins enabled.</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A20</name>
                  <description>EBI_A[19:L] pins enabled.</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A21</name>
                  <description>EBI_A[20:L] pins enabled.</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A22</name>
                  <description>EBI_A[21:L] pins enabled.</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A23</name>
                  <description>EBI_A[22:L] pins enabled.</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A24</name>
                  <description>EBI_A[23:L] pins enabled.</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A25</name>
                  <description>EBI_A[24:L] pins enabled.</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A26</name>
                  <description>EBI_A[25:L] pins enabled.</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A27</name>
                  <description>EBI_A[26:L] pins enabled.</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A28</name>
                  <description>EBI_A[27:L] pins enabled.</description>
                  <value>0x0000001C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFTPEN</name>
              <description>EBI_TFT Pin Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAENPEN</name>
              <description>EBI_TFT Pin Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSTFTPEN</name>
              <description>EBI_CSTFT Pin Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCATION</name>
              <description>I/O Location</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRTIMING1</name>
          <description>Address Timing Register 1</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000303</resetValue>
          <resetMask>0x10000303</resetMask>
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>Address Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>Address Hold Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFALE</name>
              <description>Half Cycle ALE Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDTIMING1</name>
          <description>Read Timing Register 1</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00033F03</resetValue>
          <resetMask>0x70033F03</resetMask>
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>Read Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSTRB</name>
              <description>Read Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>Read Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRE</name>
              <description>Half Cycle REn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFETCH</name>
              <description>Prefetch Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGEMODE</name>
              <description>Page Mode Access Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRTIMING1</name>
          <description>Write Timing Register 1</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00033F03</resetValue>
          <resetMask>0x30033F03</resetMask>
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>Write Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRSTRB</name>
              <description>Write Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>Write Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFWE</name>
              <description>Half Cycle WEn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUFDIS</name>
              <description>Write Buffer Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLARITY1</name>
          <description>Polarity Register 1</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CSPOL</name>
              <description>Chip Select Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPOL</name>
              <description>Read Enable Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPOL</name>
              <description>Write Enable Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALEPOL</name>
              <description>Address Latch Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYPOL</name>
              <description>ARDY Polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLPOL</name>
              <description>BL Polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRTIMING2</name>
          <description>Address Timing Register 2</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000303</resetValue>
          <resetMask>0x10000303</resetMask>
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>Address Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>Address Hold Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFALE</name>
              <description>Half Cycle ALE Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDTIMING2</name>
          <description>Read Timing Register 2</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00033F03</resetValue>
          <resetMask>0x70033F03</resetMask>
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>Read Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSTRB</name>
              <description>Read Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>Read Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRE</name>
              <description>Half Cycle REn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFETCH</name>
              <description>Prefetch Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGEMODE</name>
              <description>Page Mode Access Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRTIMING2</name>
          <description>Write Timing Register 2</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00033F03</resetValue>
          <resetMask>0x30033F03</resetMask>
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>Write Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRSTRB</name>
              <description>Write Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>Write Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFWE</name>
              <description>Half Cycle WEn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUFDIS</name>
              <description>Write Buffer Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
